In [1]:
import pandas as pd
import numpy as np

In [11]:
df=pd.read_csv("train.csv",usecols=['Sex'])

In [12]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [13]:
pd.get_dummies(df,drop_first=True)

     Sex_male
0           1
1           0
2           0
3           0
4           1
..        ...
886         1
887         0
888         0
889         1
890         1

[891 rows x 1 columns]

In [14]:
df=pd.read_csv("train.csv",usecols=['Embarked'])

In [15]:
df["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

remove the nan values

In [17]:
df.dropna(inplace=True)

In [18]:
df["Embarked"].unique()

array(['S', 'C', 'Q'], dtype=object)

In [20]:
pd.get_dummies(df["Embarked"],drop_first=True)

     Q  S
0    0  1
1    0  0
2    0  1
3    0  1
4    0  1
..  .. ..
886  0  1
887  0  1
888  0  1
889  0  0
890  1  0

[889 rows x 2 columns]